// Напишите программу, кот выводит 3-юю цифру заданного числа 
// или сообщает, что 3ей цифры нет.
Console.Write ("Введите трёхзначное число: ");
int n = Convert.ToInt32(Console.ReadLine());
